ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x_typedefs.h
/* ==========================================================================
 *! \struct ADI_RTC_GWY_Struct
 *! \brief  RTC Gateway Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_GWY_t__
typedef struct _ADI_RTC_GWY_t {
  union {
    struct {
      unsigned int SWKEY      : 16;  /**< Software-keyed command issued by the CPU */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_GWY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_GWY_t__ */

/*@}*/

/** @defgroup CR1 RTC Control 1 (CR1) Register
 *  RTC Control 1 (CR1) Register.
 *
 *  CR1 register expands the granularity of RTC control which is already available via CR0. 
 *  
 *  
 *  
 *  
 *  Note that CR1 is only configurable in RTC1, whereas in RTC0 it is a read-only register with fixed (reset) settings.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_CR1_Struct
 *! \brief  RTC Control 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR1_t__
typedef struct _ADI_RTC_CR1_t {
  union {
    struct {
      unsigned int CNTINTEN   :  1;  /**< Enable for the RTC count interrupt source */
      unsigned int PSINTEN    :  1;  /**< Enable for the prescaled, modulo-1 interrupt source */
      unsigned int RTCTRMINTEN :  1;  /**< Enable for the RTC Trim interrupt source */
      unsigned int CNTROLLINTEN :  1;  /**< Enable for the RTC count roll-over interrupt source in RTC Status 2 Register */
      unsigned int CNTMOD60ROLLINTEN :  1;  /**< Enable for the RTC modulo-60 count roll-over interrupt source in RTC Status 2 Register */
      unsigned int PRESCALE2EXP      :  4;  /**< Prescale power of 2 division factor for the RTC base clock */
      unsigned int reserved9         :  7;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR1_t__ */

/*@}*/

/** @defgroup SR2 RTC Status 2 (SR2) Register
 *  RTC Status 2 (SR2) Register.
 *
 *  SR2 is a status register which further complements the status information provided by SR0 and SR1. 
 *  RTC1 has full SR2 functionality, RTC0 has reduced features.
 *  
 *  
 *  
 *  
 *  All interrupt sources in SR2 are sticky, active high, level signals. Each source can be cleared by writing one to it.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR2_Struct
 *! \brief  RTC Status 2 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR2_t__
typedef struct _ADI_RTC_SR2_t {
  union {
    struct {
      unsigned int CNTINT     :  1;  /**< RTC count interrupt source */
      unsigned int PSINT      :  1;  /**< RTC prescaled, modulo-1 boundary interrupt source */
      unsigned int TRMINT     :  1;  /**< RTC Trim interrupt source */
      unsigned int CNTROLLINT :  1;  /**< RTC count roll-over interrupt source */
      unsigned int CNTMOD60ROLLINT :  1;  /**< RTC modulo-60 count roll-over interrupt source */
      unsigned int CNTROLL         :  1;  /**< RTC count roll-over */
      unsigned int CNTMOD60ROLL    :  1;  /**< RTC count modulo-60 roll-over */
      unsigned int TRMBDYMIR       :  1;  /**< Mirror of the RTCTRMBDY field of RTC Modulo Register */
      unsigned int reserved8       :  4;
      unsigned int WPNDCR1MIR      :  1;  /**< Pending status of posted writes to RTC Control 1 Register */
      unsigned int WPNDALM2MIR     :  1;  /**< Pending status of posted writes to RTC Alarm 2 Register */
      unsigned int WSYNCCR1MIR     :  1;  /**< Synchronization status of posted writes to RTC Control 1 Register */
      unsigned int WSYNCALM2MIR    :  1;  /**< Synchronization status of posted writes to RTC Alarm 2 Register */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR2_t__ */

/*@}*/

/** @defgroup SNAP0 RTC Snapshot 0 (SNAP0) Register
 *  RTC Snapshot 0 (SNAP0) Register.
 *
 *  SNAP0 is a sticky snapshot of the value of CNT0. It is updated (along with its counterparts SNAP1 and SNAP2), thereby overwriting any previous value of {SNAP1, SNAP0}. {SNAP2}, whenever either of the following two events occurs:
 *  
 *  	(i) the CPU writes a snapshot request key of 16'h7627 to the GWY MMR.
 *  
 *  	(ii) an input-capture event occurs on the IC0 channel when enabled, provided the setting CR2IC:RTCICOWUSEN allows such overwriting.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SNAP0_Struct
 *! \brief  RTC Snapshot 0 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SNAP0_t__
typedef struct _ADI_RTC_SNAP0_t {
  union {
    struct {
      unsigned int VALUE      : 16;  /**< Constituent part of the 47-bit RTC Input Capture Channel 0, containing a sticky snapshot of  RTC Count 0 Register */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SNAP0_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SNAP0_t__ */

/*@}*/

/** @defgroup SNAP1 RTC Snapshot 1 (SNAP1) Register
 *  RTC Snapshot 1 (SNAP1) Register.
 *
 *  SNAP1 is a sticky snapshot of the value of CNT1. It is updated (along with its counterparts SNAP0 and SNAP2, thereby overwriting any previous value of {SNAP1, SNAP0}. {SNAP2}, whenever either of the following two events occurs: 
 *  
 *  	(i) the CPU writes a snapshot request key of 16'h7627 to the GWY MMR.
 *  
 *  	(ii) an input-capture event occurs on the RTCIC0 channel when enabled, provided the setting of CR2IC:RTCICOWUSEN allows such overwriting.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SNAP1_Struct
 *! \brief  RTC Snapshot 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SNAP1_t__
typedef struct _ADI_RTC_SNAP1_t {
  union {
    struct {
      unsigned int VALUE      : 16;  /**< Part of the 47-bit RTC Input Capture Channel 0 containing a sticky snapshot of  RTC Count 1 Register */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SNAP1_t;
