ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x_typedefs.h
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR3_t__ */

/*@}*/

/** @defgroup CR2IC RTC Control 2 for Configuring Input Capture Channels (CR2IC) Register
 *  RTC Control 2 for Configuring Input Capture Channels (CR2IC) Register.
 *
 *  CR2IC is a control register for configuring enables related to input-capture channels. CR2IC  contains enables for both the input-capture function itself for each channel, as well as enables for whether an event on a channel should contribute to the interrupt lines from the RTC to both the CPU and the wake-up controller.
 *  
 *  Note that this register only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_CR2IC_Struct
 *! \brief  RTC Control 2 for Configuring Input Capture Channels Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR2IC_t__
typedef struct _ADI_RTC_CR2IC_t {
  union {
    struct {
      unsigned int RTCIC0EN   :  1;  /**< Enable for the RTC Input Capture Channel 0 */
      unsigned int reserved1  :  1;
      unsigned int RTCIC2EN   :  1;  /**< Enable for the RTC Input Capture Channel 2 */
      unsigned int RTCIC3EN   :  1;  /**< Enable for the RTC Input Capture Channel 3 */
      unsigned int RTCIC4EN   :  1;  /**< Enable for the RTC Input Capture Channel 4 */
      unsigned int RTCIC0LH   :  1;  /**< Polarity of the active-going capture edge for the RTC Input Capture Channel 0 */
      unsigned int reserved6  :  1;
      unsigned int RTCIC2LH   :  1;  /**< Polarity of the active-going capture edge for the RTC Input Capture Channel 2 */
      unsigned int RTCIC3LH   :  1;  /**< Polarity of the active-going capture edge for the RTC Input Capture Channel 3 */
      unsigned int RTCIC4LH   :  1;  /**< Polarity of the active-going capture edge for the RTC Input Capture Channel 4 */
      unsigned int RTCIC0IRQEN :  1;  /**< Interrupt Enable for the RTC Input Capture Channel 0 */
      unsigned int reserved11  :  1;
      unsigned int RTCIC2IRQEN :  1;  /**< Interrupt Enable for the RTC Input Capture Channel 2 */
      unsigned int RTCIC3IRQEN :  1;  /**< Interrupt Enable for the RTC Input Capture Channel 3 */
      unsigned int RTCIC4IRQEN :  1;  /**< Interrupt Enable for the RTC Input Capture Channel 4 */
      unsigned int RTCICOWUSEN :  1;  /**< Enable Overwrite of Unread Snapshots for all RTC Input Capture Channels */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR2IC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR2IC_t__ */

/*@}*/

/** @defgroup CR3OC RTC Control 3 for Configuring Output Compare Channel (CR3OC) Register
 *  RTC Control 3 for Configuring Output Compare Channel (CR3OC) Register.
 *
 *  CR3OC is a control register for configuring enables related to 16-bit output-compare channels. 
 *  
 *  
 *  
 *  The 47-bit RTCOC0 channel is not controlled by CR3OC. This is because RTCOC0 is a synonym for the main 47-bit RTC alarm (whose interrupt source is SR0:ALMINT), which is controlled by CR0:ALMEN and CR0:ALMINTEN.
 *  
 *  Note that CR3OC only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_CR3OC_Struct
 *! \brief  RTC Control 3 for Configuring Output Compare Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR3OC_t__
typedef struct _ADI_RTC_CR3OC_t {
  union {
    struct {
      unsigned int reserved0  :  1;
      unsigned int RTCOC1EN   :  1;  /**< Enable for Output Compare Channel 1 */
      unsigned int reserved2   :  7;
      unsigned int RTCOC1IRQEN :  1;  /**< Interrupt Enable for Output Compare Channel 1 */
      unsigned int reserved10  :  6;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR3OC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR3OC_t__ */

/*@}*/

/** @defgroup CR4OC RTC Control 4 for Configuring Output Compare Channel (CR4OC) Register
 *  RTC Control 4 for Configuring Output Compare Channel (CR4OC) Register.
 *
 *  CR4OC is a control register for configuring enables related to masking and auto-reloading of the 16-bit output-compare channel OC1.
 *  
 *  
 *  Note that this register only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_RTC_CR4OC_RTCOC1MSKEN
 *! \brief  Enable for thermometer-code masking of the Output Compare 1 Channel (RTCOC1MSKEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  RTC_CR4OC_EN000 = 0,  /**< Do not apply a mask to the 16-bit Output Compare channel ${.:OC1}.                                                                      */
  RTC_CR4OC_EN001 = 1   /**< Apply a thermometer-decoded mask to the 16-bit Output Compare channel ${.:OC1} provided that channel is enabled via ${.:CR3OC:RTCOC1EN} */
} ADI_RTC_CR4OC_RTCOC1MSKEN;


/* ==========================================================================
 *! \struct ADI_RTC_CR4OC_Struct
 *! \brief  RTC Control 4 for Configuring Output Compare Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_CR4OC_t__
typedef struct _ADI_RTC_CR4OC_t {
  union {
    struct {
      unsigned int reserved0   :  1;
      unsigned int RTCOC1MSKEN :  1;  /**< Enable for thermometer-code masking of the Output Compare 1 Channel */
      unsigned int reserved2   :  7;
      unsigned int RTCOC1ARLEN :  1;  /**< Enable for auto-reloading when output compare match occurs */
      unsigned int reserved10  :  6;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_CR4OC_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_CR4OC_t__ */

/*@}*/

/** @defgroup OCMSK RTC Masks for Output Compare Channel (OCMSK) Register
 *  RTC Masks for Output Compare Channel (OCMSK) Register.
 *
 *  OCMSK contains a 4-bit encoded mask, which are decoded out to four 16-bit thermometer-code mask to define contiguous don't care bit positions for target alarm times in the 16-bit output compare channel 1.
 *  
 *  Note that this register only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

