ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x_typedefs.h
/* ==========================================================================
 *! \struct ADI_RTC_OCMSK_Struct
 *! \brief  RTC Masks for Output Compare Channel Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_OCMSK_t__
typedef struct _ADI_RTC_OCMSK_t {
  union {
    struct {
      unsigned int RTCOCMSK   : 16;  /**< Concatenation of thermometer-encoded masks for the output compare channel */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_OCMSK_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_OCMSK_t__ */

/*@}*/

/** @defgroup OC1ARL RTC Auto-Reload for Output Compare Channel 1 (OC1ARL) Register
 *  RTC Auto-Reload for Output Compare Channel 1 (OC1ARL) Register.
 *
 *  OC1ARL contains the 16-bit reload value which is optionally (enabled by CR4OC:RTCOC1ARLEN) added to the cumulative value of OC1, visible in the OC1TGT register, whenever an enabled output compare event occurs on that channel. Only OC1 has this reload capability.
 *  
 *  The use of OC1ARL allows a repeating alarm whose periodicity either is or is not a power of 2 to be put into effect for OC1. 
 *  
 *  If reloading is not enabled, the read-back values of OC1 and OC1TGT are the same, namely the starting (and not reloaded because not enabled) output-compare value in OC1.
 *  
 *  
 *  Note that this register only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_OC1ARL_Struct
 *! \brief  RTC Auto-Reload for Output Compare Channel 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_OC1ARL_t__
typedef struct _ADI_RTC_OC1ARL_t {
  union {
    struct {
      unsigned int RTCOC1ARL  : 16;  /**< Auto-reload value when output compare match occurs */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_OC1ARL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_OC1ARL_t__ */

/*@}*/

/** @defgroup IC2 RTC Input Capture Channel 2 (IC2) Register
 *  RTC Input Capture Channel 2 (IC2) Register.
 *
 *  IC2 is a read-only snapshot of the 16 lowest {integer_bits, fractional_bits} with meaning of the main 47-bit RTC count at the most recent event on input capture channel 2.
 *  
 *  
 *  Note that this register only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_IC2_Struct
 *! \brief  RTC Input Capture Channel 2 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_IC2_t__
typedef struct _ADI_RTC_IC2_t {
  union {
    struct {
      unsigned int RTCIC2     : 16;  /**< RTC Input Capture Channel 2 */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_IC2_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_IC2_t__ */

/*@}*/

/** @defgroup IC3 RTC Input Capture Channel 3 (IC3) Register
 *  RTC Input Capture Channel 3 (IC3) Register.
 *
 *  IC3is a read-only snapshot of the 16 lowest {integer_bits, fractional_bits} with meaning of the main 47-bit RTC count at the most recent event on input capture channel 3.
 *  
 *  
 *  
 *  Note that this register only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_IC3_Struct
 *! \brief  RTC Input Capture Channel 3 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_IC3_t__
typedef struct _ADI_RTC_IC3_t {
  union {
    struct {
      unsigned int RTCIC3     : 16;  /**< RTC Input Capture Channel 3 */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_IC3_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_IC3_t__ */

/*@}*/

/** @defgroup IC4 RTC Input Capture Channel 4 (IC4) Register
 *  RTC Input Capture Channel 4 (IC4) Register.
 *
 *  IC4 is a read-only snapshot of the 16 lowest {integer_bits, fractional_bits} with meaning of the main 47-bit RTC count at the most recent event on input capture channel 4.
 *  
 *  
 *  
 *  Note that this register only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_IC4_Struct
 *! \brief  RTC Input Capture Channel 4 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_IC4_t__
typedef struct _ADI_RTC_IC4_t {
  union {
    struct {
      unsigned int RTCIC4     : 16;  /**< RTC Input Capture Channel 4 */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_IC4_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_IC4_t__ */

/*@}*/

/** @defgroup OC1 RTC Output Compare Channel 1 (OC1) Register
 *  RTC Output Compare Channel 1 (OC1) Register.
 *
 *  OC1 is the scheduled alarm time for output capture channel 1 with respect to the 16 lowest {integer_bits, fractional_bits} with meaning of the main 47-bit RTC count. The upper bits of the main RTC count, beyond these 16 bit positions, are don't cares for the purposes of the 16-bit  OC1 output compare channel.
 *  
 *  
 *  
 *  
 *  Note that this register only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_OC1_Struct
 *! \brief  RTC Output Compare Channel 1 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_OC1_t__
typedef struct _ADI_RTC_OC1_t {
  union {
    struct {
      unsigned int RTCOC1     : 16;  /**< RTC Output Compare 1 Channel */
    };
    uint16_t VALUE16;
  };
} ADI_RTC_OC1_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_OC1_t__ */

/*@}*/

/** @defgroup SR4 RTC Status 4 (SR4) Register
 *  RTC Status 4 (SR4) Register.
 *
 *  SR4 is a status register which provides the synchronization status of posted writes and posted reads to those registers related to input capture and output control which are sourced in the 32 kHz always-on half of the RTC.
 *  
 *  
 *  
 *  Note that SR4 only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

