ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x_typedefs.h
/* ==========================================================================
 *! \struct ADI_RTC_SR4_Struct
 *! \brief  RTC Status 4 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR4_t__
typedef struct _ADI_RTC_SR4_t {
  union {
    struct {
      unsigned int WSYNCSR3   :  1;  /**< Synchronization status of posted clearances to interrupt sources in RTC Status 3 Register */
      unsigned int WSYNCCR2IC :  1;  /**< Synchronization status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register */
      unsigned int WSYNCCR3OC :  1;  /**< Synchronization status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register */
      unsigned int WSYNCCR4OC :  1;  /**< Synchronization status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register */
      unsigned int WSYNCOCMSK :  1;  /**< Synchronization status of posted writes to RTC Masks for Output Compare Channel Register */
      unsigned int WSYNCOC1ARL :  1;  /**< Synchronization status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register */
      unsigned int WSYNCOC1    :  1;  /**< Synchronization status of posted writes to RTC Output Compare Channel 1 Register */
      unsigned int reserved7   :  3;
      unsigned int RSYNCIC0    :  1;  /**< Synchronization status of posted reads of RTC Input Channel 0 */
      unsigned int reserved11  :  1;
      unsigned int RSYNCIC2    :  1;  /**< Synchronization status of posted reads of RTC Input Channel 2 */
      unsigned int RSYNCIC3    :  1;  /**< Synchronization status of posted reads of RTC Input Channel 3 */
      unsigned int RSYNCIC4    :  1;  /**< Synchronization status of posted reads of RTC Input Channel 4 */
      unsigned int reserved15  :  1;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR4_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR4_t__ */

/*@}*/

/** @defgroup SR5 RTC Status 5 (SR5) Register
 *  RTC Status 5 (SR5) Register.
 *
 *  SR5 is a status register which provides the pending (buffered and enqueued) status of posted writes to those registers related to input capture and output control which are sourced in the 32 kHz always-on half of the RTC.
 *  
 *  
 *  
 *  Note that SR5 only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR5_Struct
 *! \brief  RTC Status 5 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR5_t__
typedef struct _ADI_RTC_SR5_t {
  union {
    struct {
      unsigned int WPENDSR3   :  1;  /**< Pending status of posted clearances of interrupt sources in RTC Status 3 Register */
      unsigned int WPENDCR2IC :  1;  /**< Pending status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register */
      unsigned int WPENDCR3OC :  1;  /**< Pending status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register */
      unsigned int WPENDCR4OC :  1;  /**< Pending status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register */
      unsigned int WPENDOCMSK :  1;  /**< Pending status of posted writes to RTC Masks for Output Compare Channel Register */
      unsigned int WPENDOC1ARL :  1;  /**< Pending status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register */
      unsigned int WPENDOC1    :  1;  /**< Pending status of posted writes to Output Compare Channel 1 */
      unsigned int reserved7   :  3;
      unsigned int RPENDIC0    :  1;  /**< Pending status of posted reads of RTC Input Channel 0 */
      unsigned int reserved11  :  1;
      unsigned int RPENDIC2    :  1;  /**< Pending status of posted reads of RTC Input Channel 2 */
      unsigned int RPENDIC3    :  1;  /**< Pending status of posted reads of RTC Input Channel 3 */
      unsigned int RPENDIC4    :  1;  /**< Pending status of posted reads of RTC Input Channel 4 */
      unsigned int reserved15  :  1;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR5_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR5_t__ */

/*@}*/

/** @defgroup SR6 RTC Status 6 (SR6) Register
 *  RTC Status 6 (SR6) Register.
 *
 *  SR6 is a status register which provides the unread status of snapshots of input-capture channels, IC0, IC2, IC3 and IC4.
 *  
 *  
 *  
 *  Note that SR6 only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_RTC_SR6_Struct
 *! \brief  RTC Status 6 Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_SR6_t__
typedef struct _ADI_RTC_SR6_t {
  union {
    struct {
      unsigned int RTCIC0UNR  :  1;  /**< Sticky unread status of the RTC Input Capture Channel 0 */
      unsigned int reserved1  :  1;
      unsigned int RTCIC2UNR  :  1;  /**< Sticky unread status of the RTC Input Capture Channel 2 */
      unsigned int RTCIC3UNR  :  1;  /**< Sticky unread status of the RTC Input Capture Channel 3 */
      unsigned int RTCIC4UNR  :  1;  /**< Sticky unread status of the RTC Input Capture Channel 4 */
      unsigned int reserved5  :  3;
      unsigned int RTCIC0SNAP :  1;  /**< Confirmation that RTC Snapshot 0, 1, 2 registers reflect the value of RTC Input Capture Channel 0 */
      unsigned int RTCFRZCNTPTR :  2;  /**< Pointer for the triple-read sequence of the RTC Freeze Count MMR */
      unsigned int reserved11   :  5;
    };
    uint16_t VALUE16;
  };
} ADI_RTC_SR6_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_SR6_t__ */

/*@}*/

/** @defgroup OC1TGT RTC Output Compare Channel 1 Target (OC1TGT) Register
 *  RTC Output Compare Channel 1 Target (OC1TGT) Register.
 *
 *  Reflects the current, cumulative target alarm time for the OC1 channel.
 *  
 *  OC1TGT only exists in RTC1. In RTC0, the register address is reserved and reads back as the register's reset value.
 *  @{
 */

