ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x_typedefs.h
/* ==========================================================================
 *! \struct ADI_UART_ASRH_Struct
 *! \brief  Auto Baud Status (High) Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_ASRH_t__
typedef struct _ADI_UART_ASRH_t {
  union {
    struct {
      unsigned int CNT        :  8;  /**< CNT[19:12] Auto Baud Counter value */
      unsigned int reserved8  :  8;
    };
    uint16_t VALUE16;
  };
} ADI_UART_ASRH_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_ASRH_t__ */

/*@}*/

/** @defgroup CFG Beeper configuration (CFG) Register
 *  Beeper configuration (CFG) Register.
 *
 *  
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_BEEP_CFG_Struct
 *! \brief  Beeper configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_BEEP_CFG_t__
typedef struct _ADI_BEEP_CFG_t {
  union {
    struct {
      unsigned int SEQREPEAT  :  8;  /**< Beeper Sequence Repeat value */
      unsigned int EN         :  1;  /**< Beeper Enable */
      unsigned int reserved9  :  1;
      unsigned int ASTARTIRQ  :  1;  /**< Tone A start IRQ */
      unsigned int AENDIRQ    :  1;  /**< Tone A end IRQ */
      unsigned int BSTARTIRQ  :  1;  /**< Tone B start IRQ */
      unsigned int BENDIRQ    :  1;  /**< Tone B end IRQ */
      unsigned int SEQNEARENDIRQ :  1;  /**< Sequence 1 cycle from end IRQ */
      unsigned int SEQATENDIRQ   :  1;  /**< Sequence end IRQ */
    };
    uint16_t VALUE16;
  };
} ADI_BEEP_CFG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_BEEP_CFG_t__ */

/*@}*/

/** @defgroup STAT Beeper status (STAT) Register
 *  Beeper status (STAT) Register.
 *
 *  
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_BEEP_STAT_Struct
 *! \brief  Beeper status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_BEEP_STAT_t__
typedef struct _ADI_BEEP_STAT_t {
  union {
    struct {
      unsigned int SEQREMAIN  :  8;  /**< Remaining tone-pair sequence iterations to play in SEQ mode */
      unsigned int BUSY       :  1;  /**< Beeper is busy */
      unsigned int reserved9  :  1;
      unsigned int ASTARTED   :  1;  /**< Tone A has started */
      unsigned int AENDED     :  1;  /**< Tone A has ended */
      unsigned int BSTARTED   :  1;  /**< Tone B has started */
      unsigned int BENDED     :  1;  /**< Tone B has ended */
      unsigned int SEQNEAREND :  1;  /**< Sequencer last tone-pair has started */
      unsigned int SEQENDED   :  1;  /**< Sequencer has ended */
    };
    uint16_t VALUE16;
  };
} ADI_BEEP_STAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_BEEP_STAT_t__ */

/*@}*/

/** @defgroup TONEA Tone A Data (TONEA) Register
 *  Tone A Data (TONEA) Register.
 *
 *  Tone A is the first tone to play in Sequence Mode, and the only tone to play in Pulse Mode. Writing 0x0 to the DUR field while Tone A is playing will immediately terminate the tone. All other writes to TONE_A affect the next play back of the tone only and do not affect the currently playing tone.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_BEEP_TONEA_Struct
 *! \brief  Tone A Data Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_BEEP_TONEA_t__
typedef struct _ADI_BEEP_TONEA_t {
  union {
    struct {
      unsigned int DUR        :  8;  /**< Tone duration */
      unsigned int FREQ       :  7;  /**< Tone frequency */
      unsigned int DIS        :  1;  /**< Output disable */
    };
    uint16_t VALUE16;
  };
} ADI_BEEP_TONEA_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_BEEP_TONEA_t__ */

/*@}*/

/** @defgroup TONEB Tone B Data (TONEB) Register
 *  Tone B Data (TONEB) Register.
 *
 *  Tone B is the second tone to play in Sequence Mode, and is not played Pulse Mode. Writing 0x0 to the DUR field while Tone B is playing will immediately terminate the tone. All other writes to TONE_B affect the next play back of the tone only and do not affect the currently playing tone.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_BEEP_TONEB_Struct
 *! \brief  Tone B Data Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_BEEP_TONEB_t__
typedef struct _ADI_BEEP_TONEB_t {
  union {
    struct {
      unsigned int DUR        :  8;  /**< Tone duration */
      unsigned int FREQ       :  7;  /**< Tone frequency */
      unsigned int DIS        :  1;  /**< Output disable */
    };
    uint16_t VALUE16;
  };
} ADI_BEEP_TONEB_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_BEEP_TONEB_t__ */

/*@}*/

/** @defgroup CFG ADC Configuration (CFG) Register
 *  ADC Configuration (CFG) Register.
 *
 *  
 *  @{
 */

/*  =========================================================================
 *! \enum   ADI_ADC_CFG_VREFSEL
 *! \brief  To select Vref as 1.25 V or 2.5 V (VREFSEL) Enumerations
 *  ========================================================================= */
typedef enum
{
  ADC_CFG_V_2P5  = 0,  /**< Vref = 2.5V  */
  ADC_CFG_V_1P25 = 1   /**< Vref = 1.25V */
} ADI_ADC_CFG_VREFSEL;


/*  =========================================================================
 *! \enum   ADI_ADC_CFG_REFBUFEN
 *! \brief  To enable internal reference buffer (REFBUFEN) Enumerations
 *  ========================================================================= */
typedef enum
{
  ADC_CFG_EN000 = 0,  /**< External reference is used  */
  ADC_CFG_EN001 = 1   /**< Reference buffer is enabled */
} ADI_ADC_CFG_REFBUFEN;


/* ==========================================================================
 *! \struct ADI_ADC_CFG_Struct
 *! \brief  ADC Configuration Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ADC_CFG_t__
typedef struct _ADI_ADC_CFG_t {
  union {
    struct {
      unsigned int PWRUP      :  1;  /**< Powering up the ADC */
      unsigned int VREFSEL    :  1;  /**< To select Vref as 1.25 V or 2.5 V */
      unsigned int REFBUFEN   :  1;  /**< To enable internal reference buffer */
      unsigned int reserved3  :  1;
      unsigned int EN         :  1;  /**< To enable ADC subsystem */
      unsigned int STARTCAL   :  1;  /**< To start a new offset calibration cycle */
      unsigned int RST        :  1;  /**< Resets internal buffers and registers when high */
      unsigned int SINKEN     :  1;  /**< To enable additional 50 uA sink current capability @1.25 V, 100 uA current capability @2.5 V */
      unsigned int TMPEN      :  1;  /**< To power up temperature sensor */
      unsigned int FAST_DISCH :  1;  /**< For fast switchover of Vref from higher to lower reference voltage */
      unsigned int reserved10 :  6;
    };
    uint16_t VALUE16;
  };
} ADI_ADC_CFG_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ADC_CFG_t__ */

/*@}*/

/** @defgroup PWRUP ADC Power-up Time (PWRUP) Register
 *  ADC Power-up Time (PWRUP) Register.
 *
 *  
 *  @{
 */

