ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM302X/TARGET_ADUCM3029/device/sys/ADuCM302x_typedefs.h
/* ==========================================================================
 *! \struct ADI_CLKG_OSC_KEY_Struct
 *! \brief  Key Protection for OSCCTRL Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_KEY_t__
typedef struct _ADI_CLKG_OSC_KEY_t {
  union {
    struct {
      unsigned int VALUE      : 16;  /**< Oscillator key */
      unsigned int reserved16 : 16;
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_OSC_KEY_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_KEY_t__ */

/*@}*/

/** @defgroup CTL Oscillator Control (CTL) Register
 *  Oscillator Control (CTL) Register.
 *
 *  The OSCCTRL register is key-protected. To unlock this protection 0xCB14 should be written to OSCKEY before writing to OSCCTRL  A write to any other register on the APB bus before writing to OSCCTRL will return the protection to the lock state.
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_CLKG_OSC_CTL_Struct
 *! \brief  Oscillator Control Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_CTL_t__
typedef struct _ADI_CLKG_OSC_CTL_t {
  union {
    struct {
      unsigned int LFCLKMUX   :  1;  /**< 32 kHz Clock Select Mux */
      unsigned int HFOSCEN    :  1;  /**< High Frequency Internal Oscillator Enable */
      unsigned int LFXTALEN   :  1;  /**< Low frequency crystal oscillator enable */
      unsigned int HFXTALEN   :  1;  /**< High frequency crystal oscillator enable */
      unsigned int LFXTAL_BYPASS :  1;  /**< Low frequency crystal oscillator Bypass */
      unsigned int LFXTAL_MON_EN :  1;  /**< LFXTAL clock monitor and Clock FAIL interrupt enable */
      unsigned int reserved6     :  2;
      unsigned int LFOSCOK       :  1;  /**< Status of LFOSC oscillator */
      unsigned int HFOSCOK       :  1;  /**< Status of HFOSC oscillator */
      unsigned int LFXTALOK      :  1;  /**< Status of LFXTAL oscillator */
      unsigned int HFXTALOK      :  1;  /**< Status of HFXTAL oscillator */
      unsigned int reserved12           : 19;
      unsigned int LFXTAL_MON_FAIL_STAT :  1;  /**< LF XTAL (crystal clock) Not Stable */
    };
    uint32_t VALUE32;
  };
} ADI_CLKG_OSC_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CLKG_OSC_CTL_t__ */

/*@}*/

/** @defgroup SRAM_CTL Control for SRAM parity and Instruction SRAM (SRAM_CTL) Register
 *  Control for SRAM parity and Instruction SRAM (SRAM_CTL) Register.
 *
 *  
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_PMG_TST_SRAM_CTL_Struct
 *! \brief  Control for SRAM parity and Instruction SRAM Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_CTL_t__
typedef struct _ADI_PMG_TST_SRAM_CTL_t {
  union {
    struct {
      unsigned int BNK0EN     :  1;  /**< Enable initialization */
      unsigned int BNK1EN     :  1;  /**< Enable initialization */
      unsigned int BNK2EN     :  1;  /**< Enable initialization */
      unsigned int BNK3EN     :  1;  /**< Enable initialization */
      unsigned int BNK4EN     :  1;  /**< Enable initialization */
      unsigned int BNK5EN     :  1;  /**< Enable initialization */
      unsigned int reserved6  :  7;
      unsigned int STARTINIT  :  1;  /**< Write one to trigger initialization. Self-cleared */
      unsigned int AUTOINIT   :  1;  /**< Automatic initialization on wake up from Hibernate mode */
      unsigned int ABTINIT    :  1;  /**< Abort current initialization. Self-cleared */
      unsigned int PENBNK0    :  1;  /**< Enable parity check */
      unsigned int PENBNK1    :  1;  /**< Enable parity check */
      unsigned int PENBNK2    :  1;  /**< Enable parity check */
      unsigned int PENBNK3    :  1;  /**< Enable parity check */
      unsigned int PENBNK4    :  1;  /**< Enable parity check */
      unsigned int PENBNK5    :  1;  /**< Enable parity check */
      unsigned int reserved22 :  9;
      unsigned int INSTREN    :  1;  /**< Enables instruction SRAM */
    };
    uint32_t VALUE32;
  };
} ADI_PMG_TST_SRAM_CTL_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_CTL_t__ */

/*@}*/

/** @defgroup SRAM_INITSTAT Initialization Status Register (SRAM_INITSTAT) Register
 *  Initialization Status Register (SRAM_INITSTAT) Register.
 *
 *  
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_PMG_TST_SRAM_INITSTAT_Struct
 *! \brief  Initialization Status Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_INITSTAT_t__
typedef struct _ADI_PMG_TST_SRAM_INITSTAT_t {
  union {
    struct {
      unsigned int BNK0       :  1;  /**< 0: Not initialized; 1: Initialization completed */
      unsigned int BNK1       :  1;  /**< 0: Not initialized; 1: Initialization completed */
      unsigned int BNK2       :  1;  /**< 0: Not initialized; 1: Initialization completed */
      unsigned int BNK3       :  1;  /**< 0: Not initialized; 1: Initialization completed */
      unsigned int BNK4       :  1;  /**< 0: Not initialized; 1: Initialization completed */
      unsigned int BNK5       :  1;  /**< 0: Not initialized; 1: Initialization completed */
      unsigned int reserved6  : 26;
    };
    uint32_t VALUE32;
  };
} ADI_PMG_TST_SRAM_INITSTAT_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_TST_SRAM_INITSTAT_t__ */

/*@}*/

/** @defgroup CLR_LATCH_GPIOS Clear GPIO After Shutdown Mode (CLR_LATCH_GPIOS) Register
 *  Clear GPIO After Shutdown Mode (CLR_LATCH_GPIOS) Register.
 *
 *  
 *  @{
 */

/* ==========================================================================
 *! \struct ADI_PMG_TST_CLR_LATCH_GPIOS_Struct
 *! \brief  Clear GPIO After Shutdown Mode Register bit field structure
 * ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_PMG_TST_CLR_LATCH_GPIOS_t__
typedef struct _ADI_PMG_TST_CLR_LATCH_GPIOS_t {
  union {
    struct {
      unsigned int VALUE      : 16;  /**< Writing 0x58FA creates a pulse to clear the latches for the GPIOs */
    };
    uint16_t VALUE16;
  };
} ADI_PMG_TST_CLR_LATCH_GPIOS_t;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_PMG_TST_CLR_LATCH_GPIOS_t__ */

/*@}*/

/** @defgroup SCRPAD_IMG Scratch Pad Image (SCRPAD_IMG) Register
 *  Scratch Pad Image (SCRPAD_IMG) Register.
 *
 *  This register is useful in Shutdown mode.
 *  The GPIO configuration, OUT registers lose its contents when in shutdown mode.
 *  32-bit Scratch register can be used to store the GPIO configuration. 
 *  Note that the bits are not wide enough to store all GPIO related configuration and output values. It is envisaged that the user might have only few combination of shutdown port configurations. Hence these combination can be remembered by storing an equivalent encoded data in the scratch 32-bit registers.
 *  User can determine the GPIO configuration after reading back the SCRATCHPAD_3V_READ register (wakeup from shutdown) .
 *  
 *  Note:  The content in the Scratch register is lost in shutdown mode if VBAT < 1.54 V
 *  @{
 */

